БухЭксп/Catalogs/ТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТорговыеПредложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяСуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьОстаткиИЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговоеПредложениеРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/ТорговыеПредложенияБПКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

//// См. ТорговыеПредложенияКлиентПереопределяемый.ОбработатьКомандуФормы.
//Процедура ОбработатьКомандуФормы(Форма, Команда) Экспорт
//	
//	
//КонецПроцедуры
//
//// См. ТорговыеПредложенияКлиентПереопределяемый.ОткрытьФормуОтправкиЗапросовЦен.
//Процедура ОткрытьФормуОтправкиЗапросовЦен(ПараметрыОткрытия) Экспорт
//	
//	ПараметрыОткрытия.Вставить("РежимЗапросаЦен", Истина);
//	ОчиститьСообщения();
//	ТорговыеПредложенияКлиент.ОткрытьФормуФормированияЗаказов(ПараметрыОткрытия);
//	
//КонецПроцедуры
//
//// См. ТорговыеПредложенияКлиентПереопределяемый.ПолучитьДанныеКонтекстаДляПодсказки.
//Процедура ПолучитьДанныеКонтекстаДляПодсказки(Знач Форма, ДанныеКонтекста) Экспорт
//	
//	Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаСписка" Тогда
//		
//		ДанныеКонтекста.РежимПокупателя = Истина;
//		
//	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаСписка" Тогда
//		
//		ДанныеКонтекста.РежимПоставщика = Истина;
//		
//	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда 
//		
//		ДанныеКонтекста.Основание = Форма.Объект.Ссылка;
//		ДанныеКонтекста.Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.Объект.Организация);
//		ДанныеКонтекста.РежимПокупателя = Истина;
//		ДанныеКонтекста.РежимПоискаПоСписку = Истина;
//		
//	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
//		
//		ДанныеКонтекста.Основание = Форма.Объект.Ссылка;
//		ДанныеКонтекста.Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.Объект.Организация);
//		ДанныеКонтекста.РежимПоставщика = Истина;
//		
//	ИначеЕсли Форма.ИмяФормы = "ЖурналДокументов.ИсходящиеДокументы.Форма.ФормаСписка"
//		ИЛИ Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка"  Тогда
//		
//		ДанныеКонтекста.РежимПоставщика = Истина;
//		
//	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда 
//		
//		ДанныеКонтекста.Основание = Форма.Объект.Ссылка;
//		ДанныеКонтекста.РежимПокупателя = Истина;
//		ДанныеКонтекста.РежимПоискаПоОтборам = Истина;
//		
//	Иначе
//		
//		ДанныеКонтекста = Неопределено;
//		
//	КонецЕсли;
//	
//	
//КонецПроцедуры
//
// См. ТорговыеПредложенияКлиентПереопределяемый.ОбработатьНажатиеПоГиперссылкеРеквизитаКарточкиТорговогоПредложения.
Процедура ОбработатьНажатиеПоГиперссылкеРеквизитаКарточкиТорговогоПредложения(ПозицияТорговогоПредложения,
				ИмяРеквизита, ДополнительныйРеквизит, Форма, ЭлементФормы, ОписаниеОповещенияОЗавершении) Экспорт

	НастройкиПубликации = ТорговыеПредложенияБПВызовСервера.НастройкиПубликации(ПозицияТорговогоПредложения.ПрайсЛист);
	
	ПоВсемТоварам            = НЕ (НастройкиПубликации = Неопределено) И НастройкиПубликации.ПоВсемТоварам;
	ПубликоватьЦены          = НЕ (НастройкиПубликации = Неопределено) И НастройкиПубликации.ПубликоватьЦены;
	ПубликоватьСрокиПоставки = НЕ (НастройкиПубликации = Неопределено) И НастройкиПубликации.ПубликоватьСрокиПоставки;
	ПубликоватьОстатки       = НЕ (НастройкиПубликации = Неопределено) И НастройкиПубликации.ПубликоватьОстатки;
	Организация              = ?(НастройкиПубликации = Неопределено, 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"), НастройкиПубликации.Организация);
	
	// Таблица Товары
	Если ИмяРеквизита = "Товары.НаименованиеНоменклатуры" Тогда
		Объект           = ПозицияТорговогоПредложения.Номенклатура;
		ИмяФормы         = "Справочник.Номенклатура.ФормаОбъекта";
		ИмяЭлементаФормы = "Наименование";
	ИначеЕсли ИмяРеквизита = "Товары.Артикул" Тогда
		Объект           = ПозицияТорговогоПредложения.Номенклатура;
		ИмяФормы         ="Справочник.Номенклатура.ФормаОбъекта";
		ИмяЭлементаФормы = "Артикул";
	ИначеЕсли ИмяРеквизита = "Товары.НаименованиеУпаковки" И ПоВсемТоварам Тогда
		
		Объект           = ПозицияТорговогоПредложения.Номенклатура;
		ИмяФормы         ="Справочник.Номенклатура.ФормаОбъекта";
		ИмяЭлементаФормы = "ЕдиницаИзмерения";
		
	ИначеЕсли ИмяРеквизита = "Товары.НаименованиеУпаковки" Тогда
		Объект           = ПозицияТорговогоПредложения.ПрайсЛист;
		ИмяФормы         ="Справочник.ТорговыеПредложения.ФормаОбъекта";
		ИмяЭлементаФормы = "ТоварыЕдиницаИзмерения";
	ИначеЕсли (ИмяРеквизита = "Товары.Цена" И НЕ ПубликоватьЦены)
		ИЛИ (ИмяРеквизита = "Товары.Наличие" И НЕ ПубликоватьОстатки) Тогда
		
		ТорговыеПредложенияКлиент.ОткрытьФормуНастроекПубликации(ПозицияТорговогоПредложения.ПрайсЛист, Форма, 
			ОписаниеОповещенияОЗавершении);
		
	ИначеЕсли (ИмяРеквизита = "Товары.Цена" ИЛИ ИмяРеквизита = "Товары.Наличие") И ПоВсемТоварам Тогда
				
	ИначеЕсли (ИмяРеквизита = "Товары.Цена" ИЛИ ИмяРеквизита = "Товары.Наличие") Тогда
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Ключ", ПозицияТорговогоПредложения.ПрайсЛист);
		
		ФормаТорговогоПредложения = ОткрытьФорму("Справочник.ТорговыеПредложения.ФормаОбъекта", ПараметрыОткрытияФормы, Форма, , , , ОписаниеОповещенияОЗавершении);
		
		СтруктураПоиска = Новый Структура("Номенклатура, ЕдиницаИзмерения", ПозицияТорговогоПредложения.Номенклатура, 
			ПозицияТорговогоПредложения.Упаковка);
		
		НайденныеСтроки = ФормаТорговогоПредложения.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() Тогда
			ФормаТорговогоПредложения.Элементы.Товары.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			ФормаТорговогоПредложения.ТекущийЭлемент = ФормаТорговогоПредложения.Элементы.ТоварыОценка;
			ФормаТорговогоПредложения.Элементы.Товары.ИзменитьСтроку()
		КонецЕсли;
		
	ИначеЕсли ИмяРеквизита = "Товары.СтавкаНДС" И НЕ ПубликоватьЦены Тогда
		
		ТорговыеПредложенияКлиент.ОткрытьФормуНастроекПубликации(ПозицияТорговогоПредложения.ПрайсЛист, Форма, 
			ОписаниеОповещенияОЗавершении);
		
	ИначеЕсли ИмяРеквизита = "Товары.СтавкаНДС" Тогда
		Объект           = ПозицияТорговогоПредложения.Номенклатура;
		ИмяФормы         ="Справочник.Номенклатура.ФормаОбъекта";
		ИмяЭлементаФормы = "СтавкаНДС";
	ИначеЕсли ИмяРеквизита = "Товары.СрокПоставки" И НЕ ПубликоватьСрокиПоставки Тогда
		
		ТорговыеПредложенияКлиент.ОткрытьФормуНастроекПубликации(ПозицияТорговогоПредложения.ПрайсЛист, Форма, 
			ОписаниеОповещенияОЗавершении);
		
	ИначеЕсли ИмяРеквизита = "Товары.СрокПоставки" Тогда
		Объект           = ПозицияТорговогоПредложения.ПрайсЛист;
		ИмяФормы         ="Справочник.ТорговыеПредложения.ФормаОбъекта";
		ИмяЭлементаФормы = "СрокПоставки";
	КонецЕсли;
	
	// Таблица ПрайсЛистыСлужебный
	Если ИмяРеквизита = "ПрайсЛистыСлужебный.НаименованиеОрганизации" Тогда
		Объект           = Организация;
		ИмяФормы         ="Справочник.Организации.ФормаОбъекта";
		ИмяЭлементаФормы = "Наименование";
	ИначеЕсли ИмяРеквизита = "ПрайсЛистыСлужебный.ИННОрганизации" Тогда
		Объект           = Организация;
		ИмяФормы         ="Справочник.Организации.ФормаОбъекта";
		ИмяЭлементаФормы = "ИНН";
	ИначеЕсли ИмяРеквизита = "ПрайсЛистыСлужебный.КППОрганизации" Тогда
		Объект           = Организация;
		ИмяФормы         ="Справочник.Организации.ФормаОбъекта";
		ИмяЭлементаФормы = "КПП";
	КонецЕсли;

	// Таблица Контакты
	Если ИмяРеквизита = "Контакты.Телефон" Тогда
		Объект           = Организация;
		ИмяФормы         ="Справочник.Организации.ФормаОбъекта";
	ИначеЕсли ИмяРеквизита = "Контакты.ЭлектроннаяПочта" Тогда
		Объект           = Организация;
		ИмяФормы         ="Справочник.Организации.ФормаОбъекта";
	КонецЕсли;
	
	// Изображения.
	Если ИмяРеквизита = "Изображения.ФайлИзображения" Тогда
		Объект = ПозицияТорговогоПредложения.Номенклатура;
		Если ТипЗнч(ДополнительныйРеквизит) = Тип("Структура") Тогда
			Если ДополнительныйРеквизит.ТипДействия = "Добавление" Тогда
				Если ЗначениеЗаполнено(Объект) Тогда
					ИдентификаторФайла = Новый УникальныйИдентификатор;
					Фильтр = ФильтрФайловИзображенийДляПубликации();
					РаботаСФайламиКлиент.ДобавитьФайлы(Объект, ИдентификаторФайла, Фильтр, , ОписаниеОповещенияОЗавершении);
				КонецЕсли;
			ИначеЕсли ДополнительныйРеквизит.ТипДействия = "Редактирование" Тогда
				Изображение = ДополнительныйРеквизит.Изображения[ДополнительныйРеквизит.ИндексИзображения];
				Если Изображение <> Неопределено Тогда
					РаботаСФайламиКлиент.ОткрытьФормуФайла(Изображение, , ОписаниеОповещенияОЗавершении);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяФормы) И ЗначениеЗаполнено(Объект) Тогда

		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Ключ", Объект);
		
		ФормаОбъекта = ОткрытьФорму(ИмяФормы, ПараметрыОткрытияФормы, Форма, , , , ОписаниеОповещенияОЗавершении, 
			РежимОткрытияОкнаФормы.Независимый);

	КонецЕсли;
		
	Если ФормаОбъекта <> Неопределено И НЕ ПустаяСтрока(ИмяЭлементаФормы) Тогда
		ЭлементФормы = ФормаОбъекта.Элементы.Найти(ИмяЭлементаФормы);
		Если ЭлементФормы <> Неопределено Тогда
			ФормаОбъекта.ТекущийЭлемент = ЭлементФормы;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// См. ТорговыеПредложенияКлиентПереопределяемый.ОбработатьНажатиеПоГиперссылкеПричиныИсключенияИзПубликации.
Процедура ОбработатьНажатиеПоГиперссылкеПричиныИсключенияИзПубликации(Причина, ПрайсЛист,
				ПозицииТорговыхПредложений, Форма, ЭлементФормы, ОписаниеОповещенияОЗавершении) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает фильтр, используемый для выбора файлов-изображений.
//
// Возвращаемое значение:
//  Строка - строка, содержащая фильтр для файлов-изображений разрешенных для публикации ТП.
//
Функция ФильтрФайловИзображенийДляПубликации()
	
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.jpg;*.jpe)|*.bmp;*.gif;*.png;*.jpeg;*.jpg;*.jpe"
				+ "|Формат bmp(*.bmp)|*.bmp"
				+ "|Формат GIF(*.gif)|*.gif"
				+ "|Формат JPEG(*.jpeg;*.jpg;*.jpe)|*.jpeg;*.jpg;*.jpe"
				+ "|Формат PNG(*.png)|*.png'");
		
КонецФункции

#КонецОбласти
